app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
---
  def index
    urls = Url.all

SELECT  "urls".* FROM "urls" WHERE "urls"."shortened" = ? LIMIT ?  [["shortened", "123456"], ["LIMIT", 1]]
---
  def show
    url = Url.find_by(shortened: url_params[:shortened])